---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedGlazing.GlazingTransmissionColor
source: html/59b879fa-8658-206a-e3e4-ee33c981d1b6.htm
---
# Autodesk.Revit.DB.Visual.AdvancedGlazing.GlazingTransmissionColor Property

The property labeled "Transmissive color" from the "AdvancedGlazing" schema.

## Syntax (C#)
```csharp
public static string GlazingTransmissionColor { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.